  "use strict"
  class Question{
    constructor(content , sulotion , op1 , op2 , op3 , op4){
      this.content = content;
      this.sulotion= sulotion;
      this.op1 = op1;
      this.op2 = op2;
      this.op3 = op3;
      this.op4 = op4;
    }
  }

  var content1 = "تتمثل معوقات الاستفادة من التوجهات الحديثة في تكنولوجيا المعلومات فيما يلي ................";
  var sulotion1 ="معوقات إدارية وبشرية ومالية";
  var op11 ="معوقات إدارية فقط";
  var op21 ="معوقات بشرية فقط";
  var op31 ="معوقات مالية فقط";
  var op41 ="معوقات إدارية وبشرية ومالية";

  var content2 = "من ضمن معوقات الاستفادة من التوجهات الحديثة في تكنولوجيا المعلومات .........................";
  var sulotion2="ضعف التخطيط والتنسيق لبرامج الإدارة الإلكترونية";
  var op12 ="قوة التخطيط لبرامج الإدارة الالكترونية";
  var op22 ="ضعف التخطيط والتنسيق لبرامج الإدارة الإلكترونية";
  var op32 ="قوة التنسيق بين برامج الإدارة الالكترونية";
  var op42 ="قوة التنظيم لبرامج الإدارة الالكترونية";

  var content3 = "من ضمن المعوقات الإدارية للاستفادة من التوجهات الحديثة في تكنولوجيا المعلومات ما يلي";
  var sulotion3 ="كل ما سبق";
  var op13 ="ضعف برامج التوعية الإعلامية المواكبة لتطبيق الإدارة الإلكترونية";
  var op23 ="غياب التشريعات المناسبة التي تضمن استمرار تطبيق تكنولوجيا المعلومات";
  var op33 ="كل ما سبق";
  var op43 ="طول الإجراءات الإدارية داخل المشروع";

  var content4 =  "تتعدد المعوقات البشرية للاستفادة من التوجهات الحديثة في تكنولوجيا المعلومات";
  var sulotion4 = "كل ما سبق";
  var op14 ="جهل العديد من الأفراد بأهمية التقنيات الحديثة";
  var op24 ="نقص التوعية لدى الأفراد بالميزات المرجوة";
  var op34 ="كل ما سبق";
  var op44 ="عدم اقتناع بعض الأفراد بأهمية التحول للتكنولوجيا ونظم المعلومات";

  var q1 = new Question(content1, sulotion1, op11,  op21,  op31 , op41);
  var q2 = new Question(content2, sulotion2, op12 , op22,  op32 , op42);
  var q3 = new Question(content3, sulotion3, op13 , op23,  op33 , op43);
  var q4 = new Question(content4, sulotion4, op14,  op24,  op34 , op44);

  const questions = [q1 , q2 , q3 ,q4];

